'浸漬タンクB
'===================================================================================================================
'
'<<<<<<<	ユニット	>>>>>>>>
'
'===================================================================================================================
'
'	浸漬タンクB管理 注水管理
'	
'===================================================================================================================
客先コード=川崎北部
'===================================================================================================================
select case 客先コード

case 川崎南部

case 川崎北部

end select
'===================================================================================================================
'【 初期化処理 】
if CR2008 then
    浸漬タンクBAutoMode=ON
    浸漬タンクBAutoRun=OFF
    浸漬タンクB許可=ON
    浸漬タンクBOrgErr=OFF
    浸漬タンクBErr=OFF
    浸漬タンクBEmg=OFF
    浸漬タンクBstep=0
    浸漬タンクBErrStep=0
    浸漬タンクBOrgErrStep=0
    浸漬タンクBEmgStep=0
	
end if
'===================================================================================================================
'【 原点 】
浸漬タンクBOrg=1

'===================================================================================================================
'【 緊急停止 】

	if not(PB非常停止) then
		浸漬タンクBEmgStep=1
	end if

	select case 浸漬タンクBEmgStep
	case 0
	case 1
		浸漬タンクBEmg=ON
		inc(浸漬タンクBEmgStep)	
	case 2
		if ResetFlg then
			inc(浸漬タンクBEmgStep)	
		end if
	case 3
		if StartFlg then
			inc(浸漬タンクBEmgStep)
		end if
	case 4
		浸漬タンクBEmg=OFF
		浸漬タンクBEmgStep=0
	end select

'===================================================================================================================
'【 タイムエラー検出および計測エラー検出】

	tmr(not(FLOS4_LMT121),timdly_FLOS4_LMT121,20)
	tmr(FLOS4_LMT121,timnotdly_FLOS4_LMT121,20)


'===================================================================================================================
'【 System条件 】
'次のフラグはリードコマンド（書き換え不可）
'System :: 浸漬タンクBAutoMode	自動モード セレクトスイッチ
'System :: 浸漬タンクBAutoRun	継続運転可能
'System :: 浸漬Aユニット許可 該当ユニット動作可能 
'System :: 浸漬タンクBEmg	その場停止

if SSW3_自動モード and not(浸漬タンクBEmg)  then

	RLY5_パドルセンサ電源=ON	

	if 前処理注水完了 and 前処理工程step=0 then

		tmr(TIM_冷却ON_B,DM_冷却時間*10) 'ON=10秒
		tmr(TIM_冷却OFF_B,DM_冷却インターバル時間*10) 'OFF=30分
		if ldp(TIM_冷却OFF_B.B) then
			res(TIM_冷却OFF_B) '自分のタイマーをクリアし、30分ごとのトリガを発生
			res(TIM_冷却ON_B)
		end if
		

		if pnlPB強制米有B or PDL4_パドルセンサー下限B or not(FLOS4_LMT121) then
			if not(TIM_冷却ON_B.B) then
				extSV11_給水電磁弁B=ON
			else
				extSV11_給水電磁弁B=OFF	
			end if

		else
			extSV11_給水電磁弁B=OFF	
		end if

	else
		extSV11_給水電磁弁B=OFF		
		res(TIM_冷却OFF_B)	'自分のタイマーをクリアし、30分ごとのトリガを発生
		res(TIM_冷却ON_B)
	end if

else
	ejectSV11_給水電磁弁B=OFF		
	RLY5_パドルセンサ電源=OFF
	res(TIM_冷却OFF_B)	'自分のタイマーをクリアし、30分ごとのトリガを発生
	res(TIM_冷却ON_B)
end if

