'浸漬タンクA
'===================================================================================================================
'
'<<<<<<<	ユニット	>>>>>>>>
'
'===================================================================================================================
'
'	浸漬タンクA管理 注水管理
'
'===================================================================================================================
客先コード=川崎北部
'===================================================================================================================
select case 客先コード

case 川崎南部

case 川崎北部

end select
'===================================================================================================================
'【 初期化処理 】
if CR2008 then
    浸漬タンクAAutoMode=ON
    浸漬タンクAAutoRun=OFF
    浸漬タンクA許可=ON
    浸漬タンクAOrgErr=OFF
    浸漬タンクAErr=OFF
    浸漬タンクAEmg=OFF
    浸漬タンクAstep=0
    浸漬タンクAErrStep=0
    浸漬タンクAOrgErrStep=0
    浸漬タンクAEmgStep=0

end if
'===================================================================================================================
'【 原点 】
浸漬タンクAOrg=1

'===================================================================================================================
'【 緊急停止 】

	if not(PB非常停止) then
		浸漬タンクAEmgStep=1
	end if

	select case 浸漬タンクAEmgStep
	case 0
	case 1
		浸漬タンクAEmg=ON
		inc(浸漬タンクAEmgStep)
	case 2
		if ResetFlg then
			inc(浸漬タンクAEmgStep)	
		end if
	case 3
		if StartFlg then
			inc(浸漬タンクAEmgStep)	
		end if
	case 4
		浸漬タンクAEmg=OFF
		浸漬タンクAEmgStep=0
	end select

'===================================================================================================================
'【 タイムエラー検出および計測エラー検出】

'===================================================================================================================
' センサー検出ディレイ―
	
	tmr(not(FLOS3_LMT121),timdly_FLOS03_LMT121,20)
	tmr(FLOS3_LMT121,timnotdly_FLOS03_LMT121,20)


'===================================================================================================================
'【 System条件 】
'次のフラグはリードコマンド（書き換え不可）
'System :: 浸漬タンクAAutoMode	自動モード セレクトスイッチ
'System :: 浸漬タンクAAutoRun	継続運転可能
'System :: 浸漬Aユニット許可 該当ユニット動作可能 
'System :: EmgFlg	その場停止



if SSW3_自動モード and not(浸漬タンクAEmg) then

	RLY5_パドルセンサ電源=ON

	if 前処理注水完了 and 前処理工程step=0 then
		
		tmr(TIM_冷却ON_A,DM_冷却時間*10) 'ON=10秒
		tmr(TIM_冷却OFF_A,DM_冷却インターバル時間*10) 'OFF=30分
		if ldp(TIM_冷却OFF_A.B) then
			res(TIM_冷却OFF_A) '自分のタイマーをクリアし、30分ごとのトリガを発生
			res(TIM_冷却ON_A)
		end if

		if pnlPB強制米有A or PDL2_パドルセンサー下限A or not(FLOS3_LMT121) then
			if not(TIM_冷却ON_A.B) then
				extSV6_給水電磁弁A=ON
			else
				extSV6_給水電磁弁A=OFF	
			end if

		else
			extSV6_給水電磁弁A=OFF	
		end if

	else
		extSV6_給水電磁弁A=OFF
		res(TIM_冷却OFF_A)'自分のタイマーをクリアし、30分ごとのトリガを発生
		res(TIM_冷却ON_A)

	end if

else
	extSV6_給水電磁弁A=OFF
	RLY5_パドルセンサ電源=OFF
	res(TIM_冷却OFF_A)'自分のタイマーをクリアし、30分ごとのトリガを発生
	res(TIM_冷却ON_A)

end if
